docs/2026-09-18.md
```mermaid
classDiagram
    class Kinoko {
        -String suffix
    }

    class Hero {
        -String name
        -int hp
        -Sword sword
        +int money$
        +void bye()
        -void die()
        +void attack(Kinoko enemy)
        +void run()
        +void sit(int sec)
        +void slip()
        +void sleep()
        +void setRandomMoney()$
    }

    class Sword {
        -String name
        -int damage
    }

    class Wizard {
        -String name
        -int hp
        -int mp
        -Wand wand
        +void heal(Hero hero)
    }

    class Wand {
        -String name
        -double power
    }

    class Person {
        -String name
        -int birthYear
        +int getAge(LocalDate date)
    }

    %% Relationship
    Hero --> Sword : Has-A
    Wizard --> Wand : Has-A

    Hero ..> Kinoko : Uses-A
    Wizard ..> Hero : Uses-A
```
